[
  {
    "name": "Critical - Severe Pain",
    "patient_name": "John Smith",
    "visit_date": "2024-11-10T14:30:00",
    "department": "Emergency",
    "doctor_name": "Dr. Michael Brown",
    "feedback_text": "I came to the emergency room with severe chest pain and difficulty breathing. After waiting for 4 hours, I was finally seen. The pain has gotten worse since the procedure and I'm experiencing dizziness and nausea. I'm very worried about potential heart complications. The staff seemed rushed and didn't fully address my concerns about the worsening symptoms.",
    "rating": 1
  },
  {
    "name": "Positive Experience",
    "patient_name": "Emily Johnson",
    "visit_date": "2024-11-10T10:00:00",
    "department": "Pediatrics",
    "doctor_name": "Dr. Sarah Williams",
    "feedback_text": "Excellent experience! Dr. Williams was very patient and explained everything clearly to both me and my child. The nursing staff was friendly and professional. The facilities were clean and well-maintained. The wait time was reasonable and we felt comfortable throughout the entire visit. Thank you for the great care!",
    "rating": 5
  },
  {
    "name": "Service Quality Issue",
    "patient_name": "Robert Chen",
    "visit_date": "2024-11-09T16:00:00",
    "department": "OPD",
    "doctor_name": "Dr. James Wilson",
    "feedback_text": "Very disappointed with the service. I waited over 3 hours in the OPD waiting area. The staff seemed overwhelmed and communication was poor. When I finally saw the doctor, he seemed rushed and didn't listen to all my symptoms properly. The reception staff was also unhelpful when I asked about the delay.",
    "rating": 2
  },
  {
    "name": "Mixed - Medical Concern",
    "patient_name": "Maria Garcia",
    "visit_date": "2024-11-08T11:00:00",
    "department": "Cardiology",
    "doctor_name": "Dr. Lisa Anderson",
    "feedback_text": "The doctor was knowledgeable and the diagnosis was clear. However, I'm concerned about the medication side effects I'm experiencing - severe headaches and stomach pain that started after taking the prescribed medication. I tried calling the clinic multiple times but couldn't reach anyone. The treatment plan seems good but I need follow-up support regarding these side effects.",
    "rating": 3
  },
  {
    "name": "Safety Concern - Critical",
    "patient_name": "David Thompson",
    "visit_date": "2024-11-10T09:00:00",
    "department": "General Medicine",
    "doctor_name": "Dr. Thomas Moore",
    "feedback_text": "I'm very concerned about a medication error. I was prescribed medication that I'm allergic to, and the pharmacy caught it before dispensing. This could have been very dangerous and life-threatening. I also noticed the doctor didn't check my medical history properly before prescribing. This is a serious safety concern that needs immediate attention and investigation.",
    "rating": 1
  },
  {
    "name": "Staff Behavior Issue",
    "patient_name": "Jennifer Lee",
    "visit_date": "2024-11-07T13:00:00",
    "department": "Emergency",
    "doctor_name": "Dr. Robert Taylor",
    "feedback_text": "The nursing staff was very rude and unprofessional. They were dismissive of my concerns and made me feel uncomfortable. One nurse was particularly condescending when I asked questions about my treatment. The doctor was fine, but the overall experience was ruined by the poor attitude of the nursing staff. This needs to be addressed.",
    "rating": 2
  },
  {
    "name": "Billing Issue",
    "patient_name": "Michael Davis",
    "visit_date": "2024-11-06T15:00:00",
    "department": "OPD",
    "doctor_name": "Dr. Patricia White",
    "feedback_text": "The medical care was good, but I'm very frustrated with the billing department. I was charged for services I didn't receive and when I tried to dispute it, the billing staff was unhelpful and dismissive. I've been trying to resolve this for weeks with no success. The charges are incorrect and this needs to be fixed immediately.",
    "rating": 2
  },
  {
    "name": "Cleanliness Issue",
    "patient_name": "Susan Martinez",
    "visit_date": "2024-11-05T10:30:00",
    "department": "Lab",
    "doctor_name": "",
    "feedback_text": "The lab facilities were not clean. I noticed dirty surfaces and the restroom was in poor condition. The waiting area had trash on the floor and the chairs were sticky. This is unacceptable for a medical facility. The staff was okay but the cleanliness standards need improvement.",
    "rating": 2
  },
  {
    "name": "Treatment Quality - Positive",
    "patient_name": "William Brown",
    "visit_date": "2024-11-04T14:00:00",
    "department": "Orthopedics",
    "doctor_name": "Dr. Christopher Lee",
    "feedback_text": "Outstanding treatment! Dr. Lee was thorough in his examination and explained my condition clearly. The treatment plan was effective and I'm already feeling much better. The follow-up care instructions were detailed and helpful. I'm very grateful for the excellent medical care I received.",
    "rating": 5
  },
  {
    "name": "Wait Time - High Priority",
    "patient_name": "Amanda Wilson",
    "visit_date": "2024-11-03T08:00:00",
    "department": "Emergency",
    "doctor_name": "Dr. Daniel Harris",
    "feedback_text": "I arrived at the emergency room at 8 AM with severe abdominal pain. I waited for 5 hours before being seen by a doctor. During this time, my pain worsened significantly. The waiting area was overcrowded and there was no communication about the delay. This is unacceptable for an emergency situation. I understand emergencies happen, but 5 hours is too long.",
    "rating": 1
  }
]

